{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "-": 0,
      ".": 1,
      "?": 2,
      "F": 3,
      "I": 4,
      "S": 5,
      "W": 6,
      "c": 7,
      "e": 8,
      "i": 9,
      "n": 10,
      "o": 11,
      "r": 12,
      "t": 13,
      "ං": 14,
      "අ": 15,
      "ආ": 16,
      "ඇ": 17,
      "ඈ": 18,
      "ඉ": 19,
      "ඊ": 20,
      "උ": 21,
      "ඍ": 22,
      "එ": 23,
      "ඒ": 24,
      "ඔ": 25,
      "ඕ": 26,
      "ක": 27,
      "ඛ": 28,
      "ග": 29,
      "ඟ": 30,
      "ච": 31,
      "ජ": 32,
      "ඤ": 33,
      "ට": 34,
      "ඩ": 35,
      "ණ": 36,
      "ඬ": 37,
      "ත": 38,
      "ථ": 39,
      "ද": 40,
      "ධ": 41,
      "න": 42,
      "ඳ": 43,
      "ප": 44,
      "බ": 45,
      "භ": 46,
      "ම": 47,
      "ඹ": 48,
      "ය": 49,
      "ර": 50,
      "ල": 51,
      "ව": 52,
      "ශ": 53,
      "ෂ": 54,
      "ස": 55,
      "හ": 56,
      "ළ": 57,
      "ෆ": 58,
      "්": 59,
      "ා": 60,
      "ැ": 61,
      "ෑ": 62,
      "ි": 63,
      "ී": 64,
      "ු": 65,
      "ූ": 66,
      "ෙ": 67,
      "ේ": 68,
      "ො": 69,
      "ෝ": 70,
      "‌": 71,
      "‍": 72,
      "න්": 73,
      "වා": 74,
      "ිය": 75,
      "පි": 76,
      "න්න": 77,
      "යි": 78,
      "අපි": 79,
      "ක්": 80,
      "ුව": 81,
      "කර": 82,
      "මට": 83,
      "වු": 84,
      "හු": 85,
      "නවා": 86,
      "ඇය": 87,
      "එය": 88,
      "මම": 89,
      "ඔවු": 90,
      "මු": 91,
      "ල්": 92,
      "ති": 93,
      "මි": 94,
      "සි": 95,
      "ත්": 96,
      "හැ": 97,
      "කළ": 98,
      "තා": 99,
      "වි": 100,
      "ඔහු": 101,
      "ඔවුන්": 102,
      "පු": 103,
      "ස්": 104,
      "පා": 105,
      "යා": 106,
      "හි": 107,
      "හැක": 108,
      "රු": 109,
      "ලා": 110,
      "ම්": 111,
      "නි": 112,
      "නො": 113,
      "ළුව": 114,
      "ේද": 115,
      "මා": 116,
      "ඔබ": 117,
      "වෙ": 118,
      "ේය": 119,
      "පුළුව": 120,
      "පුළුවන්": 121,
      "කා": 122,
      "කො": 123,
      "ගිය": 124,
      "දු": 125,
      "රය": 126,
      "තු": 127,
      "කිය": 128,
      "දෙ": 129,
      "කළා": 130,
      "දි": 131,
      "නා": 132,
      "කතා": 133,
      "ගත්": 134,
      "මේ": 135,
      "ැම": 136,
      "පො": 137,
      "වැ": 138,
      "ඔවුහු": 139,
      "කු": 140,
      "නැ": 141,
      "මෙ": 142,
      "ව්": 143,
      "හෙ": 144,
      "ෝය": 145,
      "පාස": 146,
      "පොත": 147,
      "ලි": 148,
      "සු": 149,
      "කී": 150,
      "කැම": 151,
      "නය": 152,
      "කරනවා": 153,
      "තිබ": 154,
      "විසි": 155,
      "නු": 156,
      "බණ": 157,
      "ලිය": 158,
      "ෙමු": 159,
      "‍ර": 160,
      "කරන්න": 161,
      "ගෙ": 162,
      "ගන්න": 163,
      "තර": 164,
      "යෝ": 165,
      "යන්න": 166,
      "සා": 167,
      "විසින්": 168,
      "කි": 169,
      "රුව": 170,
      "සයි": 171,
      "කරයි": 172,
      "මිල": 173,
      "කොහ": 174,
      "තිබේද": 175,
      "එක": 176,
      "ගේ": 177,
      "තිය": 178,
      "මො": 179,
      "ර්": 180,
      "රා": 181,
      "සෙ": 182,
      "ිද": 183,
      "ුවා": 184,
      "හැකිද": 185,
      "කාම": 186,
      "ගත්තා": 187,
      "ව්වා": 188,
      "කැමති": 189,
      "ගා": 190,
      "යට": 191,
      "රි": 192,
      "විය": 193,
      "ළි": 194,
      "ෙන්": 195,
      "ල්ලා": 196,
      "මේක": 197,
      "මොක": 198,
      "අස": 199,
      "ගු": 200,
      "යද": 201,
      "යයි": 202,
      "වස": 203,
      "සෑ": 204,
      "ැල්": 205,
      "න්ද": 206,
      "පිළි": 207,
      "ක්ද": 208,
      "කරමු": 209,
      "ඔබට": 210,
      "වෙලා": 211,
      "ගියේය": 212,
      "කියව": 213,
      "පාසැල්": 214,
      "කීයද": 215,
      "ආසයි": 216,
      "ඕන": 217,
      "කඩ": 218,
      "කෑ": 219,
      "ණි": 220,
      "දැ": 221,
      "බල්ලා": 222,
      "ෙනවා": 223,
      "න්නේ": 224,
      "ගියා": 225,
      "කාමරය": 226,
      "අප": 227,
      "ඔයා": 228,
      "ගස්": 229,
      "ගරය": 230,
      "ඟට": 231,
      "චි": 232,
      "ද්": 233,
      "දන්න": 234,
      "නගරය": 235,
      "බු": 236,
      "මල්": 237,
      "යේ": 238,
      "රැ": 239,
      "වට": 240,
      "ෙයි": 241,
      "එයා": 242,
      "ල්ල": 243,
      "ගත්ත": 244,
      "‍රී": 245,
      "ගෙන": 246,
      "කැමතිද": 247,
      "ඇස": 248,
      "ඔහ": 249,
      "කෝ": 250,
      "ඩා": 251,
      "ප්": 252,
      "පැ": 253,
      "බැ": 254,
      "බි": 255,
      "යක්": 256,
      "යනවා": 257,
      "රණ": 258,
      "රඹ": 259,
      "ලට": 260,
      "වයි": 261,
      "සතු": 262,
      "හය": 263,
      "ළඟට": 264,
      "ීමට": 265,
      "ෙන": 266,
      "ෙහි": 267,
      "ොම": 268,
      "වාය": 269,
      "ියි": 270,
      "කරමි": 271,
      "ඇයට": 272,
      "ඔවුන්ට": 273,
      "පාඩ": 274,
      "මාව": 275,
      "පුළුවන්ද": 276,
      "කළාය": 277,
      "වැඩ": 278,
      "මෙහි": 279,
      "සුළඟට": 280,
      "රුවෝ": 281,
      "කොහේද": 282,
      "කොහොම": 283,
      "සෙල": 284,
      "මොකක්ද": 285,
      "ගුරුව": 286,
      "දැන්": 287,
      "නගරයට": 288,
      "ඔහුව": 289,
      "උග": 290,
      "උද": 291,
      "උප": 292,
      "උපාස": 293,
      "එන්න": 294,
      "කයා": 295,
      "කයෝ": 296,
      "කන්ද": 297,
      "ග්": 298,
      "ගනි": 299,
      "ච්": 300,
      "ජේ": 301,
      "ටම": 302,
      "ටි": 303,
      "ටුව": 304,
      "දරුවෝ": 305,
      "නම": 306,
      "පිය": 307,
      "මත": 308,
      "මගේ": 309,
      "රිය": 310,
      "රක්": 311,
      "ලු": 312,
      "වද": 313,
      "වෝ": 314,
      "වක්": 315,
      "සො": 316,
      "්‍": 317,
      "ෙමි": 318,
      "අපිට": 319,
      "ක්‍රී": 320,
      "හින": 321,
      "දෙයි": 322,
      "මෙයට": 323,
      "හෙට": 324,
      "ගන්නවා": 325,
      "තියි": 326,
      "මේකට": 327,
      "අසන්න": 328,
      "ඕනේ": 329,
      "කොහොමද": 330,
      "උගන්": 331,
      "සොයා": 332,
      "ක්‍රීඩා": 333,
      "අද": 334,
      "අව": 335,
      "ආද": 336,
      "ඇඳ": 337,
      "ඉන්න": 338,
      "උපා": 339,
      "කට": 340,
      "කල්": 341,
      "ගත": 342,
      "ගන": 343,
      "ගස": 344,
      "චා": 345,
      "ජනා": 346,
      "ඩුවා": 347,
      "ණා": 348,
      "තෝ": 349,
      "දල්": 350,
      "දනු": 351,
      "දවස": 352,
      "පළ": 353,
      "බල": 354,
      "බළ": 355,
      "බයි": 356,
      "මග": 357,
      "මුව": 358,
      "යති": 359,
      "රී": 360,
      "ලැ": 361,
      "වන්න": 362,
      "වේද": 363,
      "වෝය": 364,
      "වීමට": 365,
      "වඩුවා": 366,
      "සම": 367,
      "සැ": 368,
      "සහය": 369,
      "සදනු": 370,
      "හා": 371,
      "හරි": 372,
      "ීසා": 373,
      "ෙක්": 374,
      "න්ඳ": 375,
      "කරති": 376,
      "මුදල්": 377,
      "සිකා": 378,
      "කළේය": 379,
      "වින්ඳ": 380,
      "පුටුව": 381,
      "ස්ස": 382,
      "ම්මා": 383,
      "නිවේද": 384,
      "නොවෙ": 385,
      "කොතර": 386,
      "දුර": 387,
      "දුක්": 388,
      "තුරු": 389,
      "කියන්න": 390,
      "දෙන්න": 391,
      "දිලි": 392,
      "වැට": 393,
      "කුරු": 394,
      "නැරඹ": 395,
      "නැග්": 396,
      "කැමතියි": 397,
      "නුඹ": 398,
      "තරඟ": 399,
      "යෝජනා": 400,
      "සාරා": 401,
      "මිලට": 402,
      "තියෙනවා": 403,
      "මොකද්": 404,
      "වෙලාව": 405,
      "කෑම": 406,
      "කාමරයක්": 407,
      "ප්‍ර": 408,
      "පාඩම්": 409,
      "උපාසකයෝ": 410,
      "මතක": 411,
      "උපාසිකා": 412,
      "ගනියි": 413,
      "පළා": 414,
      "කොතරම්": 415,
      "උපාසිකාවෝ": 416,
      "අඹ": 417,
      "ආය": 418,
      "ආරක්": 419,
      "ආහා": 420,
      "ඇත": 421,
      "ඉර": 422,
      "ඉගෙන": 423,
      "ඊයේ": 424,
      "එහෙ": 425,
      "කථ": 426,
      "කැ": 427,
      "ගණ": 428,
      "ගම": 429,
      "ගැ": 430,
      "ගො": 431,
      "ගටම": 432,
      "ඩ්": 433,
      "ඬුව": 434,
      "තූ": 435,
      "තේ": 436,
      "තො": 437,
      "දා": 438,
      "දිය": 439,
      "දරු": 440,
      "නට": 441,
      "නෑ": 442,
      "පද": 443,
      "පහ": 444,
      "පෙ": 445,
      "පන්": 446,
      "බා": 447,
      "බේ": 448,
      "බො": 449,
      "බෝ": 450,
      "මැ": 451,
      "මවා": 452,
      "මයා": 453,
      "යහ": 454,
      "යැ": 455,
      "යේද": 456,
      "රෑ": 457,
      "රයා": 458,
      "රදි": 459,
      "ලය": 460,
      "ලේ": 461,
      "ලීසා": 462,
      "වත": 463,
      "වහ": 464,
      "වන්": 465,
      "වමු": 466,
      "ශා": 467,
      "ශ්‍": 468,
      "සේ": 469,
      "සන්": 470,
      "සැම": 471,
      "සමාව": 472,
      "හදන්න": 473,
      "හමුව": 474,
      "ළු": 475,
      "ළිය": 476,
      "ළමයා": 477,
      "ාවි": 478,
      "න්ට": 479,
      "න්‌": 480,
      "ියා": 481,
      "පිරි": 482,
      "ුවෙමු": 483,
      "මුහු": 484,
      "සිට": 485,
      "සිනා": 486,
      "සිසු": 487,
      "ත්ත": 488,
      "ත්‍ර": 489,
      "කළහැක": 490,
      "කළෙමු": 491,
      "විලට": 492,
      "පුදු": 493,
      "නොලිය": 494,
      "නොකරයි": 495,
      "නොපද": 496,
      "ඔබේ": 497,
      "වෙනවා": 498,
      "වෙමු": 499,
      "කොහෙ": 500,
      "රයක්": 501,
      "දෙනවා": 502,
      "දෙමු": 503,
      "දිගටම": 504,
      "වැරදි": 505,
      "නැවත": 506,
      "පාසල්": 507,
      "පොතක්": 508,
      "නයට": 509,
      "යන්නෙ": 510,
      "යන්නෙහි": 511,
      "විසින්‌": 512,
      "කිව්වා": 513,
      "එකඟ": 514,
      "කාමර": 515,
      "ගත්තාය": 516,
      "ගාය": 517,
      "වසන්": 518,
      "අපට": 519,
      "චිත්‍ර": 520,
      "රැගෙන": 521,
      "ගත්තෙමු": 522,
      "ඇසුව": 523,
      "කෝවිලට": 524,
      "බැල": 525,
      "සෙලවු": 526,
      "ගුරුවරු": 527,
      "ගුරුවරයා": 528,
      "ගනිමු": 529,
      "ජේසන්": 530,
      "අවශ්‍": 531,
      "ආදරය": 532,
      "දවසම": 533,
      "බළලා": 534,
      "නිවේදනය": 535,
      "කුරුල්ල": 536,
      "නැග්ගා": 537,
      "මොකද්ද": 538,
      "ආරක්ෂ": 539,
      "දරුවා": 540,
      "යේදී": 541,
      "පුදුම": 542,
      "අවශ්‍යයි": 543,
      "en": 544,
      "ංග": 545,
      "ංහ": 546,
      "ංචා": 547,
      "අය": 548,
      "අමු": 549,
      "අහි": 550,
      "අනු": 551,
      "අසයි": 552,
      "අලු": 553,
      "අම්මා": 554,
      "අතුරු": 555,
      "අමතක": 556,
      "ආහැක": 557,
      "ආරා": 558,
      "ආච්": 559,
      "ඇද": 560,
      "ඇම": 561,
      "ඇල": 562,
      "ඇයි": 563,
      "ඇත්": 564,
      "ඇහැ": 565,
      "ඇවි": 566,
      "ඇහෙ": 567,
      "ඇකි": 568,
      "ඉඩ": 569,
      "ඉඳ": 570,
      "ඉස්": 571,
      "ඉන්නේ": 572,
      "එත": 573,
      "ඒක": 574,
      "කූ": 575,
      "ගුව": 576,
      "ජය": 577,
      "ජැ": 578,
      "ඤා": 579,
      "ටට": 580,
      "ටය": 581,
      "ට්": 582,
      "ටා": 583,
      "ටුවා": 584,
      "ටයක්": 585,
      "ඩි": 586,
      "ඩු": 587,
      "ඩුව": 588,
      "ණය": 589,
      "ණනවා": 590,
      "ණේය": 591,
      "ණයට": 592,
      "තටා": 593,
      "ථය": 594,
      "දහ": 595,
      "දේ": 596,
      "දම්": 597,
      "දකි": 598,
      "දඬුව": 599,
      "ධනා": 600,
      "නී": 601,
      "නේ": 602,
      "නතර": 603,
      "ඳු": 604,
      "පත්": 605,
      "පරා": 606,
      "පරණ": 607,
      "පෙන": 608,
      "පරක්": 609,
      "පටයක්": 610,
      "බෑ": 611,
      "බස්": 612,
      "බබා": 613,
      "මඟ": 614,
      "මල": 615,
      "මක්ද": 616,
      "යමු": 617,
      "යමි": 618,
      "යයෝ": 619,
      "රස": 620,
      "රෝ": 621,
      "රයි": 622,
      "රනවා": 623,
      "රෙයි": 624,
      "රතුරු": 625,
      "ලද": 626,
      "ලෙ": 627,
      "ලවා": 628,
      "ලෙන්": 629,
      "ලබයි": 630,
      "ලස්ස": 631,
      "වේ": 632,
      "වනවා": 633,
      "වහි": 634,
      "වේය": 635,
      "වන්නේ": 636,
      "වලට": 637,
      "වංචා": 638,
      "ශි": 639,
      "ෂේ": 640,
      "ෂ්‍": 641,
      "සඳ": 642,
      "සී": 643,
      "සුව": 644,
      "සල්": 645,
      "ළඳ": 646,
      "ෆි": 647,
      "ුණා": 648,
      "ුබෝ": 649,
      "ූහ": 650,
      "ේට": 651,
      "‍යා": 652,
      "න්තා": 653,
      "න්ගත": 654,
      "ියක්": 655,
      "ියෙන්": 656,
      "පිට": 657,
      "පිහින": 658,
      "පිරී": 659,
      "න්නට": 660,
      "ක්ෂේ": 661,
      "කරාවි": 662,
      "කරුණා": 663,
      "වුල": 664,
      "වුනා": 665,
      "හුවා": 666,
      "හුස්": 667,
      "ඇයව": 668,
      "එයට": 669,
      "ල්ම්": 670,
      "තික්ෂේ": 671,
      "මිණි": 672,
      "සිතා": 673,
      "සිදු": 674,
      "සිහින": 675,
      "සිංහ": 676,
      "ත්තා": 677,
      "හැඟ": 678,
      "කළහ": 679,
      "කළෝය": 680,
      "කළෙමි": 681,
      "විස්": 682,
      "විකු": 683,
      "විශා": 684,
      "ස්තූ": 685,
      "යාච්": 686,
      "හිද": 687,
      "හිරු": 688,
      "රුම්": 689,
      "රුතු": 690,
      "නිමා": 691,
      "නිදි": 692,
      "නිදා": 693,
      "නොකරමු": 694,
      "නොකරමි": 695,
      "මාමා": 696,
      "මාර්": 697,
      "මාපිය": 698,
      "වෙයි": 699,
      "වෙමි": 700,
      "කාර්": 701,
      "කොහිද": 702,
      "ගියෙමු": 703,
      "දුවා": 704,
      "දුන්න": 705,
      "කියනවා": 706,
      "කියන්නේ": 707,
      "දෙස්": 708,
      "දෙමාපිය": 709,
      "දිව්වා": 710,
      "කතාවක්": 711,
      "කුල්": 712,
      "කුකී": 713,
      "කුමක්ද": 714,
      "නැහැ": 715,
      "නැටුවා": 716,
      "මෙය": 717,
      "මෙහෙ": 718,
      "හෙන්න": 719,
      "ලින්": 720,
      "ලිව්වා": 721,
      "සුදු": 722,
      "සුවාය": 723,
      "කීවෝය": 724,
      "කරනවාද": 725,
      "තිබෙන": 726,
      "ලියට": 727,
      "ලියනවා": 728,
      "ලියහැක": 729,
      "කරන්නෙ": 730,
      "සාද": 731,
      "එකතු": 732,
      "සෙනවා": 733,
      "ගාව": 734,
      "වියදම්": 735,
      "අසති": 736,
      "අසනී": 737,
      "ගුරුතු": 738,
      "සෑද": 739,
      "සෑදෙයි": 740,
      "සෑහෙන්න": 741,
      "පිළිගන්න": 742,
      "පිළිකුල්": 743,
      "කියවයි": 744,
      "කියවමි": 745,
      "කඩනු": 746,
      "ණින්": 747,
      "කාමරයේ": 748,
      "දන්නවද": 749,
      "රැවුල": 750,
      "වට්": 751,
      "වටේ": 752,
      "එයාලා": 753,
      "ගත්තේය": 754,
      "ඇසූහ": 755,
      "කෝලේ": 756,
      "පැළඳ": 757,
      "පැමිණි": 758,
      "සතුටට": 759,
      "හයියෙන්": 760,
      "වැඩි": 761,
      "සෙලවෙයි": 762,
      "උදව්": 763,
      "උපදෙස්": 764,
      "ජේක්": 765,
      "ටිම්": 766,
      "පියා": 767,
      "අසන්නෝය": 768,
      "උගන්වයි": 769,
      "ඇඳපැළඳ": 770,
      "ඉන්නෙ": 771,
      "ඉන්නවා": 772,
      "කට්": 773,
      "තෝරා": 774,
      "ලැබු": 775,
      "ලැබේ": 776,
      "සැණින්": 777,
      "වින්ඳා": 778,
      "වින්ඳෙමු": 779,
      "නොවෙයි": 780,
      "දුරද": 781,
      "දුරකථ": 782,
      "දුක්වන්නේ": 783,
      "දිලිසෙනවා": 784,
      "නැරඹුවෙමු": 785,
      "තරඟය": 786,
      "ප්‍රතික්ෂේ": 787,
      "මතකයි": 788,
      "ආයුබෝ": 789,
      "ආහාර": 790,
      "ගණනය": 791,
      "ගමනය": 792,
      "ගැහුවා": 793,
      "ගොඩ": 794,
      "තේරුම්": 795,
      "තොරතුරු": 796,
      "පහර": 797,
      "බොරු": 798,
      "පිරිසිදු": 799,
      "සිටී": 800,
      "කොහෙද": 801,
      "ගායනා": 802,
      "වසන්ත": 803,
      "චිත්‍රපටයක්": 804,
      "ඇසුවෝය": 805,
      "බැලුවා": 806,
      "සෙලවුණේය": 807,
      "ගුරුවරුන්": 808,
      "කුරුල්ලන්": 809,
      "ආරක්ෂා": 810,
      "අයියා": 811,
      "අහිමි": 812,
      "අනුගමනය": 813,
      "අතුරුදහ": 814,
      "ආරාධනා": 815,
      "ආච්චි": 816,
      "ඇහෙනවා": 817,
      "ඇකිළු": 818,
      "ඉස්කෝලේ": 819,
      "එතන": 820,
      "ගුවන්ගත": 821,
      "තටාක": 822,
      "දඬුවම්": 823,
      "පරාජය": 824,
      "පරක්කු": 825,
      "ලස්සනට": 826,
      "වහිනවා": 827,
      "ශිෂ්‍": 828,
      "ෆිල්ම්": 829,
      "පිහිනයි": 830,
      "හුස්ම": 831,
      "විස්තර": 832,
      "විශාලද": 833,
      "යාච්ඤා": 834,
      "නිදිද": 835,
      "කුකීස්": 836,
      "අසනීප": 837,
      "ගුරුතුමා": 838,
      "පැමිණිලි": 839,
      "දුරකථනය": 840,
      "ප්‍රතික්ෂේප": 841,
      "ආයුබෝවන්": 842,
      "අතුරුදහන්": 843,
      "ශිෂ්‍යයෝ": 844
    },
    "merges": [
      [
        "න",
        "්"
      ],
      [
        "ව",
        "ා"
      ],
      [
        "ි",
        "ය"
      ],
      [
        "ප",
        "ි"
      ],
      [
        "න්",
        "න"
      ],
      [
        "ය",
        "ි"
      ],
      [
        "අ",
        "පි"
      ],
      [
        "ක",
        "්"
      ],
      [
        "ු",
        "ව"
      ],
      [
        "ක",
        "ර"
      ],
      [
        "ම",
        "ට"
      ],
      [
        "ව",
        "ු"
      ],
      [
        "හ",
        "ු"
      ],
      [
        "න",
        "වා"
      ],
      [
        "ඇ",
        "ය"
      ],
      [
        "එ",
        "ය"
      ],
      [
        "ම",
        "ම"
      ],
      [
        "ඔ",
        "වු"
      ],
      [
        "ම",
        "ු"
      ],
      [
        "ල",
        "්"
      ],
      [
        "ත",
        "ි"
      ],
      [
        "ම",
        "ි"
      ],
      [
        "ස",
        "ි"
      ],
      [
        "ත",
        "්"
      ],
      [
        "හ",
        "ැ"
      ],
      [
        "ක",
        "ළ"
      ],
      [
        "ත",
        "ා"
      ],
      [
        "ව",
        "ි"
      ],
      [
        "ඔ",
        "හු"
      ],
      [
        "ඔවු",
        "න්"
      ],
      [
        "ප",
        "ු"
      ],
      [
        "ස",
        "්"
      ],
      [
        "ප",
        "ා"
      ],
      [
        "ය",
        "ා"
      ],
      [
        "හ",
        "ි"
      ],
      [
        "හැ",
        "ක"
      ],
      [
        "ර",
        "ු"
      ],
      [
        "ල",
        "ා"
      ],
      [
        "ම",
        "්"
      ],
      [
        "න",
        "ි"
      ],
      [
        "න",
        "ො"
      ],
      [
        "ළ",
        "ුව"
      ],
      [
        "ේ",
        "ද"
      ],
      [
        "ම",
        "ා"
      ],
      [
        "ඔ",
        "බ"
      ],
      [
        "ව",
        "ෙ"
      ],
      [
        "ේ",
        "ය"
      ],
      [
        "පු",
        "ළුව"
      ],
      [
        "පුළුව",
        "න්"
      ],
      [
        "ක",
        "ා"
      ],
      [
        "ක",
        "ො"
      ],
      [
        "ග",
        "ිය"
      ],
      [
        "ද",
        "ු"
      ],
      [
        "ර",
        "ය"
      ],
      [
        "ත",
        "ු"
      ],
      [
        "ක",
        "ිය"
      ],
      [
        "ද",
        "ෙ"
      ],
      [
        "කළ",
        "ා"
      ],
      [
        "ද",
        "ි"
      ],
      [
        "න",
        "ා"
      ],
      [
        "ක",
        "තා"
      ],
      [
        "ග",
        "ත්"
      ],
      [
        "ම",
        "ේ"
      ],
      [
        "ැ",
        "ම"
      ],
      [
        "ප",
        "ො"
      ],
      [
        "ව",
        "ැ"
      ],
      [
        "ඔවු",
        "හු"
      ],
      [
        "ක",
        "ු"
      ],
      [
        "න",
        "ැ"
      ],
      [
        "ම",
        "ෙ"
      ],
      [
        "ව",
        "්"
      ],
      [
        "හ",
        "ෙ"
      ],
      [
        "ෝ",
        "ය"
      ],
      [
        "පා",
        "ස"
      ],
      [
        "පො",
        "ත"
      ],
      [
        "ල",
        "ි"
      ],
      [
        "ස",
        "ු"
      ],
      [
        "ක",
        "ී"
      ],
      [
        "ක",
        "ැම"
      ],
      [
        "න",
        "ය"
      ],
      [
        "කර",
        "නවා"
      ],
      [
        "ති",
        "බ"
      ],
      [
        "වි",
        "සි"
      ],
      [
        "න",
        "ු"
      ],
      [
        "බ",
        "ණ"
      ],
      [
        "ල",
        "ිය"
      ],
      [
        "ෙ",
        "මු"
      ],
      [
        "‍",
        "ර"
      ],
      [
        "කර",
        "න්න"
      ],
      [
        "ග",
        "ෙ"
      ],
      [
        "ග",
        "න්න"
      ],
      [
        "ත",
        "ර"
      ],
      [
        "ය",
        "ෝ"
      ],
      [
        "ය",
        "න්න"
      ],
      [
        "ස",
        "ා"
      ],
      [
        "විසි",
        "න්"
      ],
      [
        "ක",
        "ි"
      ],
      [
        "ර",
        "ුව"
      ],
      [
        "ස",
        "යි"
      ],
      [
        "කර",
        "යි"
      ],
      [
        "මි",
        "ල"
      ],
      [
        "කො",
        "හ"
      ],
      [
        "තිබ",
        "ේද"
      ],
      [
        "එ",
        "ක"
      ],
      [
        "ග",
        "ේ"
      ],
      [
        "ත",
        "ිය"
      ],
      [
        "ම",
        "ො"
      ],
      [
        "ර",
        "්"
      ],
      [
        "ර",
        "ා"
      ],
      [
        "ස",
        "ෙ"
      ],
      [
        "ි",
        "ද"
      ],
      [
        "ු",
        "වා"
      ],
      [
        "හැක",
        "ිද"
      ],
      [
        "කා",
        "ම"
      ],
      [
        "ගත්",
        "තා"
      ],
      [
        "ව්",
        "වා"
      ],
      [
        "කැම",
        "ති"
      ],
      [
        "ග",
        "ා"
      ],
      [
        "ය",
        "ට"
      ],
      [
        "ර",
        "ි"
      ],
      [
        "ව",
        "ිය"
      ],
      [
        "ළ",
        "ි"
      ],
      [
        "ෙ",
        "න්"
      ],
      [
        "ල්",
        "ලා"
      ],
      [
        "මේ",
        "ක"
      ],
      [
        "මො",
        "ක"
      ],
      [
        "අ",
        "ස"
      ],
      [
        "ග",
        "ු"
      ],
      [
        "ය",
        "ද"
      ],
      [
        "ය",
        "යි"
      ],
      [
        "ව",
        "ස"
      ],
      [
        "ස",
        "ෑ"
      ],
      [
        "ැ",
        "ල්"
      ],
      [
        "න්",
        "ද"
      ],
      [
        "පි",
        "ළි"
      ],
      [
        "ක්",
        "ද"
      ],
      [
        "කර",
        "මු"
      ],
      [
        "ඔබ",
        "ට"
      ],
      [
        "වෙ",
        "ලා"
      ],
      [
        "ගිය",
        "ේය"
      ],
      [
        "කිය",
        "ව"
      ],
      [
        "පාස",
        "ැල්"
      ],
      [
        "කී",
        "යද"
      ],
      [
        "ආ",
        "සයි"
      ],
      [
        "ඕ",
        "න"
      ],
      [
        "ක",
        "ඩ"
      ],
      [
        "ක",
        "ෑ"
      ],
      [
        "ණ",
        "ි"
      ],
      [
        "ද",
        "ැ"
      ],
      [
        "බ",
        "ල්ලා"
      ],
      [
        "ෙ",
        "නවා"
      ],
      [
        "න්න",
        "ේ"
      ],
      [
        "ගිය",
        "ා"
      ],
      [
        "කාම",
        "රය"
      ],
      [
        "අ",
        "ප"
      ],
      [
        "ඔ",
        "යා"
      ],
      [
        "ග",
        "ස්"
      ],
      [
        "ග",
        "රය"
      ],
      [
        "ඟ",
        "ට"
      ],
      [
        "ච",
        "ි"
      ],
      [
        "ද",
        "්"
      ],
      [
        "ද",
        "න්න"
      ],
      [
        "න",
        "ගරය"
      ],
      [
        "බ",
        "ු"
      ],
      [
        "ම",
        "ල්"
      ],
      [
        "ය",
        "ේ"
      ],
      [
        "ර",
        "ැ"
      ],
      [
        "ව",
        "ට"
      ],
      [
        "ෙ",
        "යි"
      ],
      [
        "එය",
        "ා"
      ],
      [
        "ල්",
        "ල"
      ],
      [
        "ගත්",
        "ත"
      ],
      [
        "‍ර",
        "ී"
      ],
      [
        "ගෙ",
        "න"
      ],
      [
        "කැමති",
        "ද"
      ],
      [
        "ඇ",
        "ස"
      ],
      [
        "ඔ",
        "හ"
      ],
      [
        "ක",
        "ෝ"
      ],
      [
        "ඩ",
        "ා"
      ],
      [
        "ප",
        "්"
      ],
      [
        "ප",
        "ැ"
      ],
      [
        "බ",
        "ැ"
      ],
      [
        "බ",
        "ි"
      ],
      [
        "ය",
        "ක්"
      ],
      [
        "ය",
        "නවා"
      ],
      [
        "ර",
        "ණ"
      ],
      [
        "ර",
        "ඹ"
      ],
      [
        "ල",
        "ට"
      ],
      [
        "ව",
        "යි"
      ],
      [
        "ස",
        "තු"
      ],
      [
        "හ",
        "ය"
      ],
      [
        "ළ",
        "ඟට"
      ],
      [
        "ී",
        "මට"
      ],
      [
        "ෙ",
        "න"
      ],
      [
        "ෙ",
        "හි"
      ],
      [
        "ො",
        "ම"
      ],
      [
        "වා",
        "ය"
      ],
      [
        "ිය",
        "ි"
      ],
      [
        "කර",
        "මි"
      ],
      [
        "ඇය",
        "ට"
      ],
      [
        "ඔවුන්",
        "ට"
      ],
      [
        "පා",
        "ඩ"
      ],
      [
        "මා",
        "ව"
      ],
      [
        "පුළුවන්",
        "ද"
      ],
      [
        "කළා",
        "ය"
      ],
      [
        "වැ",
        "ඩ"
      ],
      [
        "මෙ",
        "හි"
      ],
      [
        "සු",
        "ළඟට"
      ],
      [
        "රුව",
        "ෝ"
      ],
      [
        "කොහ",
        "ේද"
      ],
      [
        "කොහ",
        "ොම"
      ],
      [
        "සෙ",
        "ල"
      ],
      [
        "මොක",
        "ක්ද"
      ],
      [
        "ගු",
        "රුව"
      ],
      [
        "දැ",
        "න්"
      ],
      [
        "නගරය",
        "ට"
      ],
      [
        "ඔහ",
        "ුව"
      ],
      [
        "උ",
        "ග"
      ],
      [
        "උ",
        "ද"
      ],
      [
        "උ",
        "ප"
      ],
      [
        "උ",
        "පාස"
      ],
      [
        "එ",
        "න්න"
      ],
      [
        "ක",
        "යා"
      ],
      [
        "ක",
        "යෝ"
      ],
      [
        "ක",
        "න්ද"
      ],
      [
        "ග",
        "්"
      ],
      [
        "ග",
        "නි"
      ],
      [
        "ච",
        "්"
      ],
      [
        "ජ",
        "ේ"
      ],
      [
        "ට",
        "ම"
      ],
      [
        "ට",
        "ි"
      ],
      [
        "ට",
        "ුව"
      ],
      [
        "ද",
        "රුවෝ"
      ],
      [
        "න",
        "ම"
      ],
      [
        "ප",
        "ිය"
      ],
      [
        "ම",
        "ත"
      ],
      [
        "ම",
        "ගේ"
      ],
      [
        "ර",
        "ිය"
      ],
      [
        "ර",
        "ක්"
      ],
      [
        "ල",
        "ු"
      ],
      [
        "ව",
        "ද"
      ],
      [
        "ව",
        "ෝ"
      ],
      [
        "ව",
        "ක්"
      ],
      [
        "ස",
        "ො"
      ],
      [
        "්",
        "‍"
      ],
      [
        "ෙ",
        "මි"
      ],
      [
        "අපි",
        "ට"
      ],
      [
        "ක්",
        "‍රී"
      ],
      [
        "හි",
        "න"
      ],
      [
        "දෙ",
        "යි"
      ],
      [
        "මෙ",
        "යට"
      ],
      [
        "හෙ",
        "ට"
      ],
      [
        "ගන්න",
        "වා"
      ],
      [
        "තිය",
        "ි"
      ],
      [
        "මේක",
        "ට"
      ],
      [
        "අස",
        "න්න"
      ],
      [
        "ඕන",
        "ේ"
      ],
      [
        "කොහොම",
        "ද"
      ],
      [
        "උග",
        "න්"
      ],
      [
        "සො",
        "යා"
      ],
      [
        "ක්‍රී",
        "ඩා"
      ],
      [
        "අ",
        "ද"
      ],
      [
        "අ",
        "ව"
      ],
      [
        "ආ",
        "ද"
      ],
      [
        "ඇ",
        "ඳ"
      ],
      [
        "ඉ",
        "න්න"
      ],
      [
        "උ",
        "පා"
      ],
      [
        "ක",
        "ට"
      ],
      [
        "ක",
        "ල්"
      ],
      [
        "ග",
        "ත"
      ],
      [
        "ග",
        "න"
      ],
      [
        "ග",
        "ස"
      ],
      [
        "ච",
        "ා"
      ],
      [
        "ජ",
        "නා"
      ],
      [
        "ඩ",
        "ුවා"
      ],
      [
        "ණ",
        "ා"
      ],
      [
        "ත",
        "ෝ"
      ],
      [
        "ද",
        "ල්"
      ],
      [
        "ද",
        "නු"
      ],
      [
        "ද",
        "වස"
      ],
      [
        "ප",
        "ළ"
      ],
      [
        "බ",
        "ල"
      ],
      [
        "බ",
        "ළ"
      ],
      [
        "බ",
        "යි"
      ],
      [
        "ම",
        "ග"
      ],
      [
        "ම",
        "ුව"
      ],
      [
        "ය",
        "ති"
      ],
      [
        "ර",
        "ී"
      ],
      [
        "ල",
        "ැ"
      ],
      [
        "ව",
        "න්න"
      ],
      [
        "ව",
        "ේද"
      ],
      [
        "ව",
        "ෝය"
      ],
      [
        "ව",
        "ීමට"
      ],
      [
        "ව",
        "ඩුවා"
      ],
      [
        "ස",
        "ම"
      ],
      [
        "ස",
        "ැ"
      ],
      [
        "ස",
        "හය"
      ],
      [
        "ස",
        "දනු"
      ],
      [
        "හ",
        "ා"
      ],
      [
        "හ",
        "රි"
      ],
      [
        "ී",
        "සා"
      ],
      [
        "ෙ",
        "ක්"
      ],
      [
        "න්",
        "ඳ"
      ],
      [
        "කර",
        "ති"
      ],
      [
        "මු",
        "දල්"
      ],
      [
        "සි",
        "කා"
      ],
      [
        "කළ",
        "ේය"
      ],
      [
        "වි",
        "න්ඳ"
      ],
      [
        "පු",
        "ටුව"
      ],
      [
        "ස්",
        "ස"
      ],
      [
        "ම්",
        "මා"
      ],
      [
        "නි",
        "වේද"
      ],
      [
        "නො",
        "වෙ"
      ],
      [
        "කො",
        "තර"
      ],
      [
        "දු",
        "ර"
      ],
      [
        "දු",
        "ක්"
      ],
      [
        "තු",
        "රු"
      ],
      [
        "කිය",
        "න්න"
      ],
      [
        "දෙ",
        "න්න"
      ],
      [
        "දි",
        "ලි"
      ],
      [
        "වැ",
        "ට"
      ],
      [
        "කු",
        "රු"
      ],
      [
        "නැ",
        "රඹ"
      ],
      [
        "නැ",
        "ග්"
      ],
      [
        "කැම",
        "තියි"
      ],
      [
        "නු",
        "ඹ"
      ],
      [
        "තර",
        "ඟ"
      ],
      [
        "යෝ",
        "ජනා"
      ],
      [
        "සා",
        "රා"
      ],
      [
        "මිල",
        "ට"
      ],
      [
        "තිය",
        "ෙනවා"
      ],
      [
        "මොක",
        "ද්"
      ],
      [
        "වෙලා",
        "ව"
      ],
      [
        "කෑ",
        "ම"
      ],
      [
        "කාමරය",
        "ක්"
      ],
      [
        "ප්",
        "‍ර"
      ],
      [
        "පාඩ",
        "ම්"
      ],
      [
        "උපාස",
        "කයෝ"
      ],
      [
        "මත",
        "ක"
      ],
      [
        "උපා",
        "සිකා"
      ],
      [
        "ගන",
        "ියි"
      ],
      [
        "පළ",
        "ා"
      ],
      [
        "කොතර",
        "ම්"
      ],
      [
        "උපාසිකා",
        "වෝ"
      ],
      [
        "අ",
        "ඹ"
      ],
      [
        "ආ",
        "ය"
      ],
      [
        "ආ",
        "රක්"
      ],
      [
        "ආ",
        "හා"
      ],
      [
        "ඇ",
        "ත"
      ],
      [
        "ඉ",
        "ර"
      ],
      [
        "ඉ",
        "ගෙන"
      ],
      [
        "ඊ",
        "යේ"
      ],
      [
        "එ",
        "හෙ"
      ],
      [
        "ක",
        "ථ"
      ],
      [
        "ක",
        "ැ"
      ],
      [
        "ග",
        "ණ"
      ],
      [
        "ග",
        "ම"
      ],
      [
        "ග",
        "ැ"
      ],
      [
        "ග",
        "ො"
      ],
      [
        "ග",
        "ටම"
      ],
      [
        "ඩ",
        "්"
      ],
      [
        "ඬ",
        "ුව"
      ],
      [
        "ත",
        "ූ"
      ],
      [
        "ත",
        "ේ"
      ],
      [
        "ත",
        "ො"
      ],
      [
        "ද",
        "ා"
      ],
      [
        "ද",
        "ිය"
      ],
      [
        "ද",
        "රු"
      ],
      [
        "න",
        "ට"
      ],
      [
        "න",
        "ෑ"
      ],
      [
        "ප",
        "ද"
      ],
      [
        "ප",
        "හ"
      ],
      [
        "ප",
        "ෙ"
      ],
      [
        "ප",
        "න්"
      ],
      [
        "බ",
        "ා"
      ],
      [
        "බ",
        "ේ"
      ],
      [
        "බ",
        "ො"
      ],
      [
        "බ",
        "ෝ"
      ],
      [
        "ම",
        "ැ"
      ],
      [
        "ම",
        "වා"
      ],
      [
        "ම",
        "යා"
      ],
      [
        "ය",
        "හ"
      ],
      [
        "ය",
        "ැ"
      ],
      [
        "ය",
        "ේද"
      ],
      [
        "ර",
        "ෑ"
      ],
      [
        "ර",
        "යා"
      ],
      [
        "ර",
        "දි"
      ],
      [
        "ල",
        "ය"
      ],
      [
        "ල",
        "ේ"
      ],
      [
        "ල",
        "ීසා"
      ],
      [
        "ව",
        "ත"
      ],
      [
        "ව",
        "හ"
      ],
      [
        "ව",
        "න්"
      ],
      [
        "ව",
        "මු"
      ],
      [
        "ශ",
        "ා"
      ],
      [
        "ශ",
        "්‍"
      ],
      [
        "ස",
        "ේ"
      ],
      [
        "ස",
        "න්"
      ],
      [
        "ස",
        "ැම"
      ],
      [
        "ස",
        "මාව"
      ],
      [
        "හ",
        "දන්න"
      ],
      [
        "හ",
        "මුව"
      ],
      [
        "ළ",
        "ු"
      ],
      [
        "ළ",
        "ිය"
      ],
      [
        "ළ",
        "මයා"
      ],
      [
        "ා",
        "වි"
      ],
      [
        "න්",
        "ට"
      ],
      [
        "න්",
        "‌"
      ],
      [
        "ිය",
        "ා"
      ],
      [
        "පි",
        "රි"
      ],
      [
        "ුව",
        "ෙමු"
      ],
      [
        "මු",
        "හු"
      ],
      [
        "සි",
        "ට"
      ],
      [
        "සි",
        "නා"
      ],
      [
        "සි",
        "සු"
      ],
      [
        "ත්",
        "ත"
      ],
      [
        "ත්",
        "‍ර"
      ],
      [
        "කළ",
        "හැක"
      ],
      [
        "කළ",
        "ෙමු"
      ],
      [
        "වි",
        "ලට"
      ],
      [
        "පු",
        "දු"
      ],
      [
        "නො",
        "ලිය"
      ],
      [
        "නො",
        "කරයි"
      ],
      [
        "නො",
        "පද"
      ],
      [
        "ඔබ",
        "ේ"
      ],
      [
        "වෙ",
        "නවා"
      ],
      [
        "වෙ",
        "මු"
      ],
      [
        "කො",
        "හෙ"
      ],
      [
        "රය",
        "ක්"
      ],
      [
        "දෙ",
        "නවා"
      ],
      [
        "දෙ",
        "මු"
      ],
      [
        "දි",
        "ගටම"
      ],
      [
        "වැ",
        "රදි"
      ],
      [
        "නැ",
        "වත"
      ],
      [
        "පාස",
        "ල්"
      ],
      [
        "පොත",
        "ක්"
      ],
      [
        "නය",
        "ට"
      ],
      [
        "යන්න",
        "ෙ"
      ],
      [
        "යන්න",
        "ෙහි"
      ],
      [
        "විසින්",
        "‌"
      ],
      [
        "කි",
        "ව්වා"
      ],
      [
        "එක",
        "ඟ"
      ],
      [
        "කාම",
        "ර"
      ],
      [
        "ගත්තා",
        "ය"
      ],
      [
        "ගා",
        "ය"
      ],
      [
        "වස",
        "න්"
      ],
      [
        "අප",
        "ට"
      ],
      [
        "චි",
        "ත්‍ර"
      ],
      [
        "රැ",
        "ගෙන"
      ],
      [
        "ගත්ත",
        "ෙමු"
      ],
      [
        "ඇස",
        "ුව"
      ],
      [
        "කෝ",
        "විලට"
      ],
      [
        "බැ",
        "ල"
      ],
      [
        "සෙල",
        "වු"
      ],
      [
        "ගුරුව",
        "රු"
      ],
      [
        "ගුරුව",
        "රයා"
      ],
      [
        "ගනි",
        "මු"
      ],
      [
        "ජේ",
        "සන්"
      ],
      [
        "අව",
        "ශ්‍"
      ],
      [
        "ආද",
        "රය"
      ],
      [
        "දවස",
        "ම"
      ],
      [
        "බළ",
        "ලා"
      ],
      [
        "නිවේද",
        "නය"
      ],
      [
        "කුරු",
        "ල්ල"
      ],
      [
        "නැග්",
        "ගා"
      ],
      [
        "මොකද්",
        "ද"
      ],
      [
        "ආරක්",
        "ෂ"
      ],
      [
        "දරු",
        "වා"
      ],
      [
        "යේද",
        "ී"
      ],
      [
        "පුදු",
        "ම"
      ],
      [
        "අවශ්‍",
        "යයි"
      ],
      [
        "e",
        "n"
      ],
      [
        "ං",
        "ග"
      ],
      [
        "ං",
        "හ"
      ],
      [
        "ං",
        "චා"
      ],
      [
        "අ",
        "ය"
      ],
      [
        "අ",
        "මු"
      ],
      [
        "අ",
        "හි"
      ],
      [
        "අ",
        "නු"
      ],
      [
        "අ",
        "සයි"
      ],
      [
        "අ",
        "ලු"
      ],
      [
        "අ",
        "ම්මා"
      ],
      [
        "අ",
        "තුරු"
      ],
      [
        "අ",
        "මතක"
      ],
      [
        "ආ",
        "හැක"
      ],
      [
        "ආ",
        "රා"
      ],
      [
        "ආ",
        "ච්"
      ],
      [
        "ඇ",
        "ද"
      ],
      [
        "ඇ",
        "ම"
      ],
      [
        "ඇ",
        "ල"
      ],
      [
        "ඇ",
        "යි"
      ],
      [
        "ඇ",
        "ත්"
      ],
      [
        "ඇ",
        "හැ"
      ],
      [
        "ඇ",
        "වි"
      ],
      [
        "ඇ",
        "හෙ"
      ],
      [
        "ඇ",
        "කි"
      ],
      [
        "ඉ",
        "ඩ"
      ],
      [
        "ඉ",
        "ඳ"
      ],
      [
        "ඉ",
        "ස්"
      ],
      [
        "ඉ",
        "න්නේ"
      ],
      [
        "එ",
        "ත"
      ],
      [
        "ඒ",
        "ක"
      ],
      [
        "ක",
        "ූ"
      ],
      [
        "ග",
        "ුව"
      ],
      [
        "ජ",
        "ය"
      ],
      [
        "ජ",
        "ැ"
      ],
      [
        "ඤ",
        "ා"
      ],
      [
        "ට",
        "ට"
      ],
      [
        "ට",
        "ය"
      ],
      [
        "ට",
        "්"
      ],
      [
        "ට",
        "ා"
      ],
      [
        "ට",
        "ුවා"
      ],
      [
        "ට",
        "යක්"
      ],
      [
        "ඩ",
        "ි"
      ],
      [
        "ඩ",
        "ු"
      ],
      [
        "ඩ",
        "ුව"
      ],
      [
        "ණ",
        "ය"
      ],
      [
        "ණ",
        "නවා"
      ],
      [
        "ණ",
        "ේය"
      ],
      [
        "ණ",
        "යට"
      ],
      [
        "ත",
        "ටා"
      ],
      [
        "ථ",
        "ය"
      ],
      [
        "ද",
        "හ"
      ],
      [
        "ද",
        "ේ"
      ],
      [
        "ද",
        "ම්"
      ],
      [
        "ද",
        "කි"
      ],
      [
        "ද",
        "ඬුව"
      ],
      [
        "ධ",
        "නා"
      ],
      [
        "න",
        "ී"
      ],
      [
        "න",
        "ේ"
      ],
      [
        "න",
        "තර"
      ],
      [
        "ඳ",
        "ු"
      ],
      [
        "ප",
        "ත්"
      ],
      [
        "ප",
        "රා"
      ],
      [
        "ප",
        "රණ"
      ],
      [
        "ප",
        "ෙන"
      ],
      [
        "ප",
        "රක්"
      ],
      [
        "ප",
        "ටයක්"
      ],
      [
        "බ",
        "ෑ"
      ],
      [
        "බ",
        "ස්"
      ],
      [
        "බ",
        "බා"
      ],
      [
        "ම",
        "ඟ"
      ],
      [
        "ම",
        "ල"
      ],
      [
        "ම",
        "ක්ද"
      ],
      [
        "ය",
        "මු"
      ],
      [
        "ය",
        "මි"
      ],
      [
        "ය",
        "යෝ"
      ],
      [
        "ර",
        "ස"
      ],
      [
        "ර",
        "ෝ"
      ],
      [
        "ර",
        "යි"
      ],
      [
        "ර",
        "නවා"
      ],
      [
        "ර",
        "ෙයි"
      ],
      [
        "ර",
        "තුරු"
      ],
      [
        "ල",
        "ද"
      ],
      [
        "ල",
        "ෙ"
      ],
      [
        "ල",
        "වා"
      ],
      [
        "ල",
        "ෙන්"
      ],
      [
        "ල",
        "බයි"
      ],
      [
        "ල",
        "ස්ස"
      ],
      [
        "ව",
        "ේ"
      ],
      [
        "ව",
        "නවා"
      ],
      [
        "ව",
        "හි"
      ],
      [
        "ව",
        "ේය"
      ],
      [
        "ව",
        "න්නේ"
      ],
      [
        "ව",
        "ලට"
      ],
      [
        "ව",
        "ංචා"
      ],
      [
        "ශ",
        "ි"
      ],
      [
        "ෂ",
        "ේ"
      ],
      [
        "ෂ",
        "්‍"
      ],
      [
        "ස",
        "ඳ"
      ],
      [
        "ස",
        "ී"
      ],
      [
        "ස",
        "ුව"
      ],
      [
        "ස",
        "ල්"
      ],
      [
        "ළ",
        "ඳ"
      ],
      [
        "ෆ",
        "ි"
      ],
      [
        "ු",
        "ණා"
      ],
      [
        "ු",
        "බෝ"
      ],
      [
        "ූ",
        "හ"
      ],
      [
        "ේ",
        "ට"
      ],
      [
        "‍",
        "යා"
      ],
      [
        "න්",
        "තා"
      ],
      [
        "න්",
        "ගත"
      ],
      [
        "ිය",
        "ක්"
      ],
      [
        "ිය",
        "ෙන්"
      ],
      [
        "පි",
        "ට"
      ],
      [
        "පි",
        "හින"
      ],
      [
        "පි",
        "රී"
      ],
      [
        "න්න",
        "ට"
      ],
      [
        "ක්",
        "ෂේ"
      ],
      [
        "කර",
        "ාවි"
      ],
      [
        "කර",
        "ුණා"
      ],
      [
        "වු",
        "ල"
      ],
      [
        "වු",
        "නා"
      ],
      [
        "හු",
        "වා"
      ],
      [
        "හු",
        "ස්"
      ],
      [
        "ඇය",
        "ව"
      ],
      [
        "එය",
        "ට"
      ],
      [
        "ල්",
        "ම්"
      ],
      [
        "ති",
        "ක්ෂේ"
      ],
      [
        "මි",
        "ණි"
      ],
      [
        "සි",
        "තා"
      ],
      [
        "සි",
        "දු"
      ],
      [
        "සි",
        "හින"
      ],
      [
        "සි",
        "ංහ"
      ],
      [
        "ත්",
        "තා"
      ],
      [
        "හැ",
        "ඟ"
      ],
      [
        "කළ",
        "හ"
      ],
      [
        "කළ",
        "ෝය"
      ],
      [
        "කළ",
        "ෙමි"
      ],
      [
        "වි",
        "ස්"
      ],
      [
        "වි",
        "කු"
      ],
      [
        "වි",
        "ශා"
      ],
      [
        "ස්",
        "තූ"
      ],
      [
        "යා",
        "ච්"
      ],
      [
        "හි",
        "ද"
      ],
      [
        "හි",
        "රු"
      ],
      [
        "රු",
        "ම්"
      ],
      [
        "රු",
        "තු"
      ],
      [
        "නි",
        "මා"
      ],
      [
        "නි",
        "දි"
      ],
      [
        "නි",
        "දා"
      ],
      [
        "නො",
        "කරමු"
      ],
      [
        "නො",
        "කරමි"
      ],
      [
        "මා",
        "මා"
      ],
      [
        "මා",
        "ර්"
      ],
      [
        "මා",
        "පිය"
      ],
      [
        "වෙ",
        "යි"
      ],
      [
        "වෙ",
        "මි"
      ],
      [
        "කා",
        "ර්"
      ],
      [
        "කො",
        "හිද"
      ],
      [
        "ගිය",
        "ෙමු"
      ],
      [
        "දු",
        "වා"
      ],
      [
        "දු",
        "න්න"
      ],
      [
        "කිය",
        "නවා"
      ],
      [
        "කිය",
        "න්නේ"
      ],
      [
        "දෙ",
        "ස්"
      ],
      [
        "දෙ",
        "මාපිය"
      ],
      [
        "දි",
        "ව්වා"
      ],
      [
        "කතා",
        "වක්"
      ],
      [
        "කු",
        "ල්"
      ],
      [
        "කු",
        "කී"
      ],
      [
        "කු",
        "මක්ද"
      ],
      [
        "නැ",
        "හැ"
      ],
      [
        "නැ",
        "ටුවා"
      ],
      [
        "මෙ",
        "ය"
      ],
      [
        "මෙ",
        "හෙ"
      ],
      [
        "හෙ",
        "න්න"
      ],
      [
        "ලි",
        "න්"
      ],
      [
        "ලි",
        "ව්වා"
      ],
      [
        "සු",
        "දු"
      ],
      [
        "සු",
        "වාය"
      ],
      [
        "කී",
        "වෝය"
      ],
      [
        "කරනවා",
        "ද"
      ],
      [
        "තිබ",
        "ෙන"
      ],
      [
        "ලිය",
        "ට"
      ],
      [
        "ලිය",
        "නවා"
      ],
      [
        "ලිය",
        "හැක"
      ],
      [
        "කරන්න",
        "ෙ"
      ],
      [
        "සා",
        "ද"
      ],
      [
        "එක",
        "තු"
      ],
      [
        "සෙ",
        "නවා"
      ],
      [
        "ගා",
        "ව"
      ],
      [
        "විය",
        "දම්"
      ],
      [
        "අස",
        "ති"
      ],
      [
        "අස",
        "නී"
      ],
      [
        "ගු",
        "රුතු"
      ],
      [
        "සෑ",
        "ද"
      ],
      [
        "සෑ",
        "දෙයි"
      ],
      [
        "සෑ",
        "හෙන්න"
      ],
      [
        "පිළි",
        "ගන්න"
      ],
      [
        "පිළි",
        "කුල්"
      ],
      [
        "කියව",
        "යි"
      ],
      [
        "කියව",
        "මි"
      ],
      [
        "කඩ",
        "නු"
      ],
      [
        "ණි",
        "න්"
      ],
      [
        "කාමරය",
        "ේ"
      ],
      [
        "දන්න",
        "වද"
      ],
      [
        "රැ",
        "වුල"
      ],
      [
        "වට",
        "්"
      ],
      [
        "වට",
        "ේ"
      ],
      [
        "එයා",
        "ලා"
      ],
      [
        "ගත්ත",
        "ේය"
      ],
      [
        "ඇස",
        "ූහ"
      ],
      [
        "කෝ",
        "ලේ"
      ],
      [
        "පැ",
        "ළඳ"
      ],
      [
        "පැ",
        "මිණි"
      ],
      [
        "සතු",
        "ටට"
      ],
      [
        "හය",
        "ියෙන්"
      ],
      [
        "වැඩ",
        "ි"
      ],
      [
        "සෙල",
        "වෙයි"
      ],
      [
        "උද",
        "ව්"
      ],
      [
        "උප",
        "දෙස්"
      ],
      [
        "ජේ",
        "ක්"
      ],
      [
        "ටි",
        "ම්"
      ],
      [
        "පිය",
        "ා"
      ],
      [
        "අසන්න",
        "ෝය"
      ],
      [
        "උගන්",
        "වයි"
      ],
      [
        "ඇඳ",
        "පැළඳ"
      ],
      [
        "ඉන්න",
        "ෙ"
      ],
      [
        "ඉන්න",
        "වා"
      ],
      [
        "කට",
        "්"
      ],
      [
        "තෝ",
        "රා"
      ],
      [
        "ලැ",
        "බු"
      ],
      [
        "ලැ",
        "බේ"
      ],
      [
        "සැ",
        "ණින්"
      ],
      [
        "වින්ඳ",
        "ා"
      ],
      [
        "වින්ඳ",
        "ෙමු"
      ],
      [
        "නොවෙ",
        "යි"
      ],
      [
        "දුර",
        "ද"
      ],
      [
        "දුර",
        "කථ"
      ],
      [
        "දුක්",
        "වන්නේ"
      ],
      [
        "දිලි",
        "සෙනවා"
      ],
      [
        "නැරඹ",
        "ුවෙමු"
      ],
      [
        "තරඟ",
        "ය"
      ],
      [
        "ප්‍ර",
        "තික්ෂේ"
      ],
      [
        "මතක",
        "යි"
      ],
      [
        "ආය",
        "ුබෝ"
      ],
      [
        "ආහා",
        "ර"
      ],
      [
        "ගණ",
        "නය"
      ],
      [
        "ගම",
        "නය"
      ],
      [
        "ගැ",
        "හුවා"
      ],
      [
        "ගො",
        "ඩ"
      ],
      [
        "තේ",
        "රුම්"
      ],
      [
        "තො",
        "රතුරු"
      ],
      [
        "පහ",
        "ර"
      ],
      [
        "බො",
        "රු"
      ],
      [
        "පිරි",
        "සිදු"
      ],
      [
        "සිට",
        "ී"
      ],
      [
        "කොහෙ",
        "ද"
      ],
      [
        "ගාය",
        "නා"
      ],
      [
        "වසන්",
        "ත"
      ],
      [
        "චිත්‍ර",
        "පටයක්"
      ],
      [
        "ඇසුව",
        "ෝය"
      ],
      [
        "බැල",
        "ුවා"
      ],
      [
        "සෙලවු",
        "ණේය"
      ],
      [
        "ගුරුවරු",
        "න්"
      ],
      [
        "කුරුල්ල",
        "න්"
      ],
      [
        "ආරක්ෂ",
        "ා"
      ],
      [
        "අය",
        "ියා"
      ],
      [
        "අහි",
        "මි"
      ],
      [
        "අනු",
        "ගමනය"
      ],
      [
        "අතුරු",
        "දහ"
      ],
      [
        "ආරා",
        "ධනා"
      ],
      [
        "ආච්",
        "චි"
      ],
      [
        "ඇහෙ",
        "නවා"
      ],
      [
        "ඇකි",
        "ළු"
      ],
      [
        "ඉස්",
        "කෝලේ"
      ],
      [
        "එත",
        "න"
      ],
      [
        "ගුව",
        "න්ගත"
      ],
      [
        "තටා",
        "ක"
      ],
      [
        "දඬුව",
        "ම්"
      ],
      [
        "පරා",
        "ජය"
      ],
      [
        "පරක්",
        "කු"
      ],
      [
        "ලස්ස",
        "නට"
      ],
      [
        "වහි",
        "නවා"
      ],
      [
        "ශි",
        "ෂ්‍"
      ],
      [
        "ෆි",
        "ල්ම්"
      ],
      [
        "පිහින",
        "යි"
      ],
      [
        "හුස්",
        "ම"
      ],
      [
        "විස්",
        "තර"
      ],
      [
        "විශා",
        "ලද"
      ],
      [
        "යාච්",
        "ඤා"
      ],
      [
        "නිදි",
        "ද"
      ],
      [
        "කුකී",
        "ස්"
      ],
      [
        "අසනී",
        "ප"
      ],
      [
        "ගුරුතු",
        "මා"
      ],
      [
        "පැමිණි",
        "ලි"
      ],
      [
        "දුරකථ",
        "නය"
      ],
      [
        "ප්‍රතික්ෂේ",
        "ප"
      ],
      [
        "ආයුබෝ",
        "වන්"
      ],
      [
        "අතුරුදහ",
        "න්"
      ],
      [
        "ශිෂ්‍",
        "යයෝ"
      ]
    ]
  }
}